#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>

```terraform
module.c6af30-team.sysdig_monitor_alert_metric.prod_db_pods_high: Refreshing state... [id=10777727]
module.c6af30-team.sysdig_monitor_alert_metric.prod_keycloak_cpu_usage_high: Refreshing state... [id=10777725]
module.c6af30-team.sysdig_monitor_alert_metric.prod_keycloak_pods_low: Refreshing state... [id=10777730]
module.c6af30-team.sysdig_monitor_alert_metric.prod_keycloak_cpu_spike_high: Refreshing state... [id=10777728]
module.c6af30-team.sysdig_monitor_dashboard.pv_usage: Refreshing state... [id=296849]
module.c6af30-team.sysdig_monitor_alert_metric.prod_db_pod_restarts_gte_1: Refreshing state... [id=10777729]
module.c6af30-team.sysdig_monitor_alert_promql.prod_sso_db_pv_gt_60: Refreshing state... [id=10777731]
module.c6af30-team.sysdig_monitor_alert_metric.prod_keycloak_cpu_usage_med: Refreshing state... [id=10777726]
module.c6af30-team.sysdig_monitor_alert_promql.prod_sso_db_pv_gt_80: Refreshing state... [id=10777733]
module.c6af30-team.sysdig_monitor_dashboard.pv_overall: Refreshing state... [id=296847]
module.c6af30-team.sysdig_monitor_alert_metric.prod_keycloak_pods_high: Refreshing state... [id=10777724]
module.c6af30-team.sysdig_monitor_alert_metric.prod_keycloak_pods_med: Refreshing state... [id=10777734]
module.c6af30-team.sysdig_monitor_dashboard.pods_cpu: Refreshing state... [id=296848]
module.c6af30-team.sysdig_monitor_alert_metric.prod_db_pods_low: Refreshing state... [id=10777732]
module.eb75ad-team.sysdig_monitor_alert_metric.prod_keycloak_pods_low: Refreshing state... [id=9921901]
module.eb75ad-team.sysdig_monitor_alert_promql.test_db_pv_usage_seventyfive: Refreshing state... [id=14625869]
module.eb75ad-team.sysdig_monitor_alert_metric.prod_keycloak_pods_med: Refreshing state... [id=9921897]
module.eb75ad-team.sysdig_monitor_dashboard.pv_overall: Refreshing state... [id=363087]
module.eb75ad-team.sysdig_monitor_alert_metric.prod_keycloak_pods_high: Refreshing state... [id=9921902]
module.eb75ad-team.sysdig_monitor_alert_metric.dev_dr_pod: Refreshing state... [id=15328793]
module.eb75ad-team.sysdig_monitor_alert_metric.prod_backup_storage_pv_usage_gt_med: Refreshing state... [id=9921933]
module.eb75ad-team.sysdig_monitor_alert_metric.prod_keycloak_cpu_spike_high: Refreshing state... [id=9921904]
module.eb75ad-team.sysdig_monitor_alert_metric.prod_db_pod_restarts_gte_1: Refreshing state... [id=9921905]
module.eb75ad-team.sysdig_monitor_alert_metric.prod_db_pods_high: Refreshing state... [id=9921906]
module.eb75ad-team.sysdig_monitor_alert_promql.test_db_pv_usage_ninety: Refreshing state... [id=14625872]
module.eb75ad-team.sysdig_monitor_alert_downtime.prod_dr_pod_downtime: Refreshing state... [id=15346483]
module.eb75ad-team.sysdig_monitor_alert_metric.test_dr_pod: Refreshing state... [id=15328794]
module.eb75ad-team.sysdig_monitor_alert_metric.prod_keycloak_log_pv_med: Refreshing state... [id=9921922]
module.eb75ad-team.sysdig_monitor_alert_metric.prod_db_pods_low: Refreshing state... [id=9921900]
module.eb75ad-team.sysdig_monitor_alert_promql.prod_minio_pvc_storage_low: Refreshing state... [id=14080753]
module.eb75ad-team.sysdig_monitor_alert_metric.prod_keycloak_cpu_usage_med: Refreshing state... [id=9921903]
module.eb75ad-team.sysdig_monitor_alert_promql.dev_db_pv_usage_seventyfive: Refreshing state... [id=14625866]
module.eb75ad-team.sysdig_monitor_alert_promql.prod_db_pv_usage_low: Refreshing state... [id=9921935]
module.eb75ad-team.sysdig_monitor_dashboard.pv_usage: Refreshing state... [id=363085]
module.eb75ad-team.sysdig_monitor_alert_promql.dev_db_pv_usage_ninety: Refreshing state... [id=14625871]
module.eb75ad-team.sysdig_monitor_alert_promql.prod_db_pv_usage_med: Refreshing state... [id=9921934]
module.eb75ad-team.sysdig_monitor_alert_downtime.test_dr_pod_downtime: Refreshing state... [id=15346484]
module.eb75ad-team.sysdig_monitor_dashboard.pods_cpu: Refreshing state... [id=363086]
module.eb75ad-team.sysdig_monitor_alert_metric.prod_keycloak_cpu_usage_high: Refreshing state... [id=9921898]
module.eb75ad-team.sysdig_monitor_alert_metric.prod_dr_pod: Refreshing state... [id=15328795]
module.eb75ad-team.sysdig_monitor_alert_promql.prod_backup_storage_pv_usage_gt_low: Refreshing state... [id=9921936]
module.eb75ad-team.sysdig_monitor_alert_downtime.dev_dr_pod_downtime: Refreshing state... [id=15338912]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # module.eb75ad-team.sysdig_monitor_dashboard.pods_cpu has changed
  ~ resource "sysdig_monitor_dashboard" "pods_cpu" {
        id           = "363086"
        name         = "Pods & CPU"
      ~ version      = 1 -> 3
        # (3 unchanged attributes hidden)

      - panel {
          - autosize_text          = false -> null
          - description            = "Description" -> null
          - height                 = 10 -> null
          - name                   = "SSO Pods Usage" -> null
          - pos_x                  = 0 -> null
          - pos_y                  = 4 -> null
          - transparent_background = false -> null
          - type                   = "timechart" -> null
          - visible_title          = false -> null
          - width                  = 24 -> null

          - query {
              - promql = "avg(sum(sysdig_container_cpu_cores_used{$__scope, kube_deployment_name='sso-keycloak'}))" -> null
              - unit   = "number" -> null
            }
        }
      + panel {
          + autosize_text          = false
          + description            = "Description"
          + height                 = 10
          + name                   = "SSO Pods Usage"
          + pos_x                  = 0
          + pos_y                  = 4
          + transparent_background = false
          + type                   = "timechart"
          + visible_title          = false
          + width                  = 24

          + query {
              + promql = "sysdig_container_cpu_cores_used{$__scope, kube_deployment_name='sso-keycloak'}"
              + unit   = "number"
            }
        }

      + scope {
          + comparator = "contains"
          + metric     = "kubernetes.pod.name"
          + value      = [
              + "sso-keycloak",
            ]
        }

        # (5 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.eb75ad-team.sysdig_monitor_alert_promql.dev_kc_disk_log_pv_usage_sixty will be created
  + resource "sysdig_monitor_alert_promql" "dev_kc_disk_log_pv_usage_sixty" {
      + description           = "only alert rocket chat and email for 60%"
      + enabled               = true
      + id                    = (known after apply)
      + name                  = "[GOLD CUST DEV] SSO Keycloak Logs PV over 60%"
      + notification_channels = [
          + 132277,
          + 57336,
        ]
      + promql                = "avg(kubelet_volume_stats_used_bytes{namespace=\"eb75ad-dev\", persistentvolumeclaim=\"sso-keycloak-logs\"}*100 / kubelet_volume_stats_capacity_bytes{namespace=\"eb75ad-dev\", persistentvolumeclaim=\"sso-keycloak-logs\"}) by (persistentvolumeclaim) > 60"
      + severity              = 4
      + team                  = (known after apply)
      + trigger_after_minutes = 2
      + version               = (known after apply)

      + custom_notification {
          + title = "{{__alert_name__}} is {{__alert_status__}}"
        }
    }

  # module.eb75ad-team.sysdig_monitor_alert_promql.prod_kc_disk_log_pv_usage_sixty will be created
  + resource "sysdig_monitor_alert_promql" "prod_kc_disk_log_pv_usage_sixty" {
      + description           = "only alert rocket chat and email for 60%"
      + enabled               = true
      + id                    = (known after apply)
      + name                  = "[GOLD CUST PROD] SSO Keycloak Logs PV over 60%"
      + notification_channels = [
          + 132277,
          + 57336,
        ]
      + promql                = "avg(kubelet_volume_stats_used_bytes{namespace=\"eb75ad-prod\", persistentvolumeclaim=\"sso-keycloak-logs\"}*100 / kubelet_volume_stats_capacity_bytes{namespace=\"eb75ad-prod\", persistentvolumeclaim=\"sso-keycloak-logs\"}) by (persistentvolumeclaim) > 60"
      + severity              = 4
      + team                  = (known after apply)
      + trigger_after_minutes = 2
      + version               = (known after apply)

      + custom_notification {
          + title = "{{__alert_name__}} is {{__alert_status__}}"
        }
    }

  # module.eb75ad-team.sysdig_monitor_alert_promql.test_kc_disk_log_pv_usage_sixty will be created
  + resource "sysdig_monitor_alert_promql" "test_kc_disk_log_pv_usage_sixty" {
      + description           = "only alert rocket chat and email for 60%"
      + enabled               = true
      + id                    = (known after apply)
      + name                  = "[GOLD CUST TEST] SSO Keycloak Logs PV over 60%"
      + notification_channels = [
          + 132277,
          + 57336,
        ]
      + promql                = "avg(kubelet_volume_stats_used_bytes{namespace=\"eb75ad-test\", persistentvolumeclaim=\"sso-keycloak-logs\"}*100 / kubelet_volume_stats_capacity_bytes{namespace=\"eb75ad-test\", persistentvolumeclaim=\"sso-keycloak-logs\"}) by (persistentvolumeclaim) > 60"
      + severity              = 4
      + team                  = (known after apply)
      + trigger_after_minutes = 2
      + version               = (known after apply)

      + custom_notification {
          + title = "{{__alert_name__}} is {{__alert_status__}}"
        }
    }

  # module.eb75ad-team.sysdig_monitor_dashboard.pods_cpu will be updated in-place
  ~ resource "sysdig_monitor_dashboard" "pods_cpu" {
        id           = "363086"
        name         = "Pods & CPU"
        # (4 unchanged attributes hidden)

      + panel {
          + autosize_text          = false
          + description            = "Description"
          + height                 = 10
          + name                   = "SSO Pods Usage"
          + pos_x                  = 0
          + pos_y                  = 4
          + transparent_background = false
          + type                   = "timechart"
          + visible_title          = false
          + width                  = 24

          + query {
              + promql = "avg(sum(sysdig_container_cpu_cores_used{$__scope, kube_deployment_name='sso-keycloak'}))"
              + unit   = "number"
            }
        }
      - panel {
          - autosize_text          = false -> null
          - description            = "Description" -> null
          - height                 = 10 -> null
          - name                   = "SSO Pods Usage" -> null
          - pos_x                  = 0 -> null
          - pos_y                  = 4 -> null
          - transparent_background = false -> null
          - type                   = "timechart" -> null
          - visible_title          = false -> null
          - width                  = 24 -> null

          - query {
              - promql = "sysdig_container_cpu_cores_used{$__scope, kube_deployment_name='sso-keycloak'}" -> null
              - unit   = "number" -> null
            }
        }
      - panel {
          - autosize_text          = false -> null
          - description            = "Description" -> null
          - height                 = 4 -> null
          - name                   = "Ready DB Pods" -> null
          - pos_x                  = 8 -> null
          - pos_y                  = 0 -> null
          - transparent_background = false -> null
          - type                   = "number" -> null
          - visible_title          = false -> null
          - width                  = 8 -> null

          - query {
              - promql = "sum(kube_pod_sysdig_status_ready{$__scope, kube_statefulset_name='sso-patroni'})" -> null
              - unit   = "number" -> null
            }
        }
      - panel {
          - autosize_text          = false -> null
          - description            = "Patroni pods are replicas of our database. We are setup to have 3 at any given time. An alert will be triggered if this fails below 3" -> null
          - height                 = 4 -> null
          - name                   = "Ready Pod" -> null
          - pos_x                  = 0 -> null
          - pos_y                  = 0 -> null
          - transparent_background = false -> null
          - type                   = "number" -> null
          - visible_title          = false -> null
          - width                  = 8 -> null

          - query {
              - promql = "sum(kube_pod_sysdig_status_ready{$__scope, kube_deployment_name='sso-keycloak'})" -> null
              - unit   = "number" -> null
            }
        }
      + panel {
          + autosize_text          = false
          + description            = "Description"
          + height                 = 4
          + name                   = "Ready DB Pods"
          + pos_x                  = 8
          + pos_y                  = 0
          + transparent_background = false
          + type                   = "number"
          + visible_title          = false
          + width                  = 8

          + query {
              + promql = "sum(kube_pod_sysdig_status_ready{$__scope, kube_statefulset_name='sso-patroni'})"
              + unit   = "number"
            }
        }
      + panel {
          + autosize_text          = false
          + description            = "Patroni pods are replicas of our database. We are setup to have 3 at any given time. An alert will be triggered if this fails below 3"
          + height                 = 4
          + name                   = "Ready Pod"
          + pos_x                  = 0
          + pos_y                  = 0
          + transparent_background = false
          + type                   = "number"
          + visible_title          = false
          + width                  = 8

          + query {
              + promql = "sum(kube_pod_sysdig_status_ready{$__scope, kube_deployment_name='sso-keycloak'})"
              + unit   = "number"
            }
        }

      - scope {
          - comparator = "contains" -> null
          - metric     = "kubernetes.pod.name" -> null
          - value      = [
              - "sso-keycloak",
            ] -> null
        }

        # (3 unchanged blocks hidden)
    }

Plan: 3 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pusher: @NithinKuruba, Action: `pull_request`*